[GenjiClass X2SoldierClassTemplate]
DisplayName="<font color='#00FFFF'>浪人</font>"
ClassSummary="源氏专精刀锋和他的苦无，他的控制论外骨骼帮助他最大限度地利用它们。"

AbilityTreeTitles[0]="剑士"
AbilityTreeTitles[1]="突击者"
AbilityTreeTitles[2]="忍者"
AbilityTreeTitles[3]="XCOM"
;-----------------------
; Genji's Weapon Abilites
;-----------------------
[GenjiOverwatch X2AbilityTemplate]
LocFriendlyName="苦无监视"
LocLongDescription="苦无监视。 "
LocHelpText="向第一个在你视线范围内移动的敌人投掷带命中惩罚的苦无。"
LocLongDescriptionWhenConcealed="向第一个在你视线范围内移动的敌人投掷苦无，但前提是必须暴露。"
LocFlyOverText="苦无监视"
LocFriendlyNameWhenConcealed="苦无监视 (隐蔽式)"

[GenjiOverwatchShot X2AbilityTemplate]
LocFriendlyName="苦无监视射击"

[GenjiThrowKnife X2AbilityTemplate]
LocFriendlyName="投掷苦无"
LocLongDescription="投掷苦无。 "
LocHelpText="<Bullet/>投掷苦无。"
LocFlyOverText="投掷苦无" 
LocPromotionPopupText="投掷苦无。"

[Dragonblade X2AbilityTemplate]
LocFriendlyName="龙刃"
LocLongDescription="毁灭性的连锁近战攻击，第一次近战攻击必中。龙刃模式下的每一次近战击杀都会产生额外的行动，但后续的近战攻击会降低伤害。"
LocHelpText="毁灭性的连锁近战攻击，第一次近战攻击必中。龙刃模式下的每一次近战击杀都会产生额外的行动。+<Ability:DRAGONBLADE_CRIT/>暴击和+<Ability:DRAGONBLADE_AIM/>命中增益。"
LocFlyOverText="龙刃"
LocPromotionPopupText="<Bullet/> <Ability:DRAGONBLADE_COOLDOWN/>回合冷却。<br/><Bullet/>龙刃不能与奔袭战术一起使用。<br/><Bullet/> 随着每一次成功的“龙刃”攻击造成的伤害降低，可能需要对目标进行仔细的排序，以确保攻击链最长。<br/>"


[GenjiParry X2AbilityTemplate]
LocFriendlyName="格挡"
LocLongDescription="使用野太刀(龙刃)攻击后，进行格挡以免疫下一次攻击受到的所有伤害，而不是移动。"
LocHelpText="使用野太刀(龙刃)攻击后，进行格挡以免疫下一次攻击受到的所有伤害，而不是移动。"
LocFlyoverText="格挡!"
LocPromotionPopupText="<Bullet/> 格挡将防止近战和远程攻击造成的伤害。<br/><Bullet/> 将使用气势赋予的行动。<br/>"

[GenjiParryActivate X2AbilityTemplate]
LocFriendlyName="格挡"
LocLongDescription="格挡敌人回合中对你的下一次攻击，免疫所有伤害。"
LocHelpText="格挡敌人回合中对你的下一次攻击，免疫所有伤害。"
LocFlyoverText="格挡!"

;-----------------------
;  SQUADDIE
;-----------------------
[GenjiCybernetics X2AbilityTemplate]
LocFriendlyName="控制体"
LocFlyOverText="控制体"
LocLongDescription="源氏的控制论给予+2机动性和爬墙的能力。"
LocHelpText="源氏的控制论给予+2机动性和爬墙的能力。"
LocPromotionPopupText="<Bullet/> 源氏的控制论给予+2机动性和爬墙的能力。<br/>"

[HeavyStrike X2AbilityTemplate]
LocFriendlyName="重击"
LocLongDescription="使用你的野太刀攻击移动范围内的任何敌人。如果事先使用闪电打击，则会减少重击的伤害。"
LocHelpText="使用您的野太刀攻击移动范围内的任何敌人。如果事先使用闪电打击，则会减少重击的伤害。"
LocPromotionPopupText="<Bullet/> 你可以通过将移动光标放在敌人身上来触发重击技能。<br/><Bullet/> 源氏可以使用两个动作进行“冲刺”移动，并仍然对相邻的敌人发动猛烈打击。<br/>"

[LightStrike X2AbilityTemplate]
LocFriendlyName="闪电打击"
LocLongDescription="使用您的胁差攻击移动范围内的任何敌人。使用闪电打击后将减少重击的伤害。"
LocHelpText="使用您的胁差攻击移动范围内的任何敌人。使用闪电打击后将减少重击的伤害。"
LocPromotionPopupText="<Bullet/> 你可以通过将移动光标放在敌人身上来触发重击技能。<br/><Bullet/> 源氏可以使用两个动作进行“冲刺”移动，并仍然对相邻的敌人发动猛烈打击并只消耗1行动点。<br/>"


[GenjiMomentum X2AbilityTemplate]
LocFriendlyName="气势"
LocLongDescription="使用重击后，获得一个额外的行动点。"
LocHelpText="使用重击后，每回合最多获得一次移动。"
LocFlyOverText="气势"

[GenjiMomentumPassive X2AbilityTemplate]
LocFriendlyName="气势"
LocLongDescription="使用重击后，获得一个额外的行动点。"
LocHelpText="使用重击后，每回合最多获得一次移动。"
LocFlyOverText="气势"


;-----------------------
; KENSHI
;-----------------------

[GenjiSureStrike X2AbilityTemplate]
LocFriendlyName="稳扎稳打"
LocLongDescription="使用您的<Ability：WeaponName/>攻击移动范围内的任何敌人，攻击必定命中且不可移动。"
LocHelpText="使用您的<Ability：WeaponName/>攻击移动范围内的任何敌人，攻击必定命中且不可移动。"
LocPromotionPopupText="<Bullet/> 你可以通过将移动光标放在敌人身上触发“稳扎稳打”技能。<br/><Bullet/> 对于确保对通常难以获得完全伤害的敌人进行击杀非常有用。<br/><Bullet/> <Ability:SURESTRIKECHARGE/>充能。<br/>"

[SwiftCooldown X2AbilityTemplate]
LocFriendlyName="迅疾一击"
LocFlyOverText="迅疾一击"
LocLongDescription="用剑攻击移动范围内的任何敌人1行动点。在你的起始位置和目标之间的每<Ability:STRIKE_BONUS_DAMAGE_PER_TILES/>格造成+1点伤害。"
LocHelpText="用剑攻击移动范围内的任何敌人。对远距离攻击造成额外伤害。"
LocPromotionPopupText="<Bullet/> 你可以通过将移动光标放在敌人身上来触发迅疾一击技能。<br/><Bullet/> 士兵可以执行“冲刺”动作，同时使用两个动作移动，并仍然触发对相邻敌人的攻击。<br/><Bullet/> 在你的起始位置和目标之间的每<Ability:STRIKE_BONUS_DAMAGE_PER_TILES/>格造成+1点伤害。<br/>"
LocFlyoverText="迅疾一击冷却降低!"

[SwiftStrike X2AbilityTemplate]
LocFriendlyName="迅疾一击"
LocFlyOverText="迅疾一击"
LocLongDescription="用剑攻击移动范围内的任何敌人1行动点。在你的起始位置和目标之间的每<Ability:STRIKE_BONUS_DAMAGE_PER_TILES/>格造成+1点伤害。"
LocHelpText="用剑攻击移动范围内的任何敌人。对远距离攻击造成额外伤害。"
LocPromotionPopupText="<Bullet/> 你可以通过将移动光标放在敌人身上来触发迅疾一击技能。<br/><Bullet/> 士兵可以执行“冲刺”动作，同时使用两个动作移动，并仍然触发对相邻敌人的攻击。<br/><Bullet/> 在你的起始位置和目标之间的每<Ability:STRIKE_BONUS_DAMAGE_PER_TILES/>格造成+1点伤害。<br/>"

[RM_FlecheEffect X2AbilityTemplate]
LocFriendlyName="迅疾一击"
LocFlyOverText="迅疾一击"
LocLongDescription="用剑攻击移动范围内的任何敌人1行动点。在你的起始位置和目标之间的每<Ability:STRIKE_BONUS_DAMAGE_PER_TILES/>格造成+1点伤害。"
LocHelpText="用剑攻击移动范围内的任何敌人。对远距离攻击造成额外伤害。"
LocPromotionPopupText="<Bullet/> 你可以通过将移动光标放在敌人身上来触发迅疾一击技能。<br/><Bullet/> 士兵可以执行“冲刺”动作，同时使用两个动作移动，并仍然触发对相邻敌人的攻击。<br/><Bullet/> 在你的起始位置和目标之间的每<Ability:STRIKE_BONUS_DAMAGE_PER_TILES/>格造成+1点伤害。<br/>"

[RM_Cutthroat X2AbilityTemplate]
LocFriendlyName="割喉"
LocFlyOverText="割喉"
LocLongDescription="源氏对生物敌人的攻击忽略他们的护甲，<Ability:CUTTHROAT_CRIT/>暴击率。"
LocHelpText="源氏对生物敌人的攻击忽略他们的护甲，<Ability:CUTTHROAT_CRIT/>暴击率。"
LocPromotionPopupText="<Bullet/> 源氏对生物敌人的攻击忽略他们的护甲，<Ability:CUTTHROAT_CRIT/>暴击率。<br/>"

[GenjiBlademaster X2AbilityTemplate]
LocFriendlyName="剑刃大师"
LocLongDescription="所有<Ability:WeaponName/>攻击造成额外+<Ability:GenjiBlademasterDmg/>伤害和+<Ability:GenjiBLADEMASTERAIM/>命中。"
LocHelpText="所有<Ability:WeaponName/>攻击造成额外+<Ability:GenjiBlademasterDmg/>伤害和+<Ability:GenjiBLADEMASTERAIM/>命中。"
LocFlyOverText="Blademaster"
LocPromotionPopupText="<Bullet/> 每次成功的<Ability:WeaponName/>攻击+<Ability:GenjiBlademasterDmg/>伤害。<br/>"


[GenjiDeflect X2AbilityTemplate]
LocFriendlyName="偏移"
LocLongDescription="源氏做好了准备，让他偏移一些来袭射击。"
LocHelpText="源氏可以偏移一些来袭射击。"
LocPromotionPopupText="<Bullet/> 可以偏移最少<Ability:DEFLECT_MINIMUM/>次射击，随着野太刀的每一次武器升级而增加。<br/><Bullet/> 只能偏移单目标射击。<br/>"

[GenjiReflect X2AbilityTemplate]
LocFriendlyName="反射"
LocLongDescription="源氏为自己做好了准备，让他对自己受到的射击进行反射。"
LocHelpText="源氏为自己做好了准备，让他对自己受到的射击进行反射。"
LocPromotionPopupText="<Bullet/> 可以偏移最少<Ability:REFLECT_MINIMUM/>次射击，随着野太刀的每一次武器升级而增加。<br/><Bullet/> 只能反射单目标射击。<br/><Bullet/>反射取代偏移，增加冷却时间，降低最低冷却时间以换取其能量。<br/>"

[GenjiReflectShot X2AbilityTemplate]
LocFriendlyName="反射"
LocLongDescription="源氏为自己做好了准备，让他对自己受到的射击进行反射。"
LocHelpText="源氏为自己做好了准备，让他对自己受到的射击进行反射。"

;-----------------------
;		SHINOBI
;-----------------------
[GenjiSting X2AbilityTemplate]
LocFriendlyName="毒刺"
LocLongDescription="在隐蔽状态投掷一枚苦无，不打破隐蔽状态。"
LocHelpText="在隐蔽状态投掷一枚苦无，不打破隐蔽状态。"
LocPromotionPopupText="<Bullet/> 毒刺允许源氏在他绝对不想暴露的情况下进行攻击。<br/><Bullet/> 每次任务<Ability:STINGERCHARGES>充能。<br/>"

[GenjiQuickdraw X2AbilityTemplate]
LocFriendlyName="迅疾苦无"
LocLongDescription="第一个行动点投掷苦无不再结束你的回合。"
LocHelpText="第一个行动点投掷苦无不再结束你的回合。"
LocFlyOverText="迅疾苦无"
LocPromotionPopupText="<Bullet/> 如果源氏想专注于远程伤害输出，迅疾苦无将非常有用。<br/>"

[GenjiLightningThrow X2AbilityTemplate]
LocFriendlyName="雷霆苦无"
LocLongDescription="向目标投掷你的苦无。不消耗行动点。"
LocHelpText="向目标投掷你的苦无。不消耗行动点。"
LocFlyOverText="雷霆苦无"
LocPromotionPopupText="<Bullet/> 雷霆苦无可与其他<Ability:ClassName/>技能很好地结合，因为它不会阻止在同一回合中使用其他技能。<br/><Bullet/> <Ability:SelfCooldown/>回合冷却。<br/>"

[GenjiFaceoff X2AbilityTemplate]
LocFriendlyName="钢铁风暴"
LocLongDescription="向每个可见的敌人投掷苦无。"
LocHelpText="向每个可见的敌人投掷苦无。"
LocPromotionPopupText="<Bullet/> 钢铁风暴最佳的增强方式是采用攻击性的定位，从而有很高的机会击中多个目标。<br/><Bullet/> <Ability:SelfCooldown/>回合冷却。<br/>"

[GenjiReturnThrow X2AbilityTemplate]
LocFriendlyName="回旋苦无"
LocHelpText="当被敌人火力瞄准时，每回合自动投掷一次苦无。"
LocLongDescription="当被敌人火力瞄准时，每回合自动投掷一次苦无。"
LocPromotionPopupText="<Bullet/> 每回合只触发一次。<br/><Bullet/> 可以由近战攻击和效果区域攻击触发。<br/><Bullet/> 当被反应火力瞄准时，回旋苦无不会触发。<br/>"

[GenjiHailstorm X2AbilityTemplate]
LocFriendlyName="冰雹风暴"
LocLongDescription="向同一目标连续投掷3次苦无。"
LocHelpText="向同一目标连续投掷3次苦无。"
LocFlyOverText="冰雹风暴"
LocPromotionPopupText="<Bullet/> 冰雹风暴中的每一次投掷都有单独的命中率。<br/><Bullet/> 如果每一次命中，冰雹风暴都会造成毁灭性的伤害。<br/><Bullet/> <Ability:SelfCooldown/>回合冷却。<br/>"

[GenjiAssassin X2AbilityTemplate]
LocFriendlyName="阿萨辛派"
LocLongDescription="源氏可以多次重新进入隐藏。<Ability:SelfCooldown/>回合冷却。"
LocHelpText="源氏可以多次重新进入隐藏。<Ability:SelfCooldown/>回合冷却。"
LocFlyOverText="阿萨辛派"
LocPromotionPopupText="<Bullet/> 隐藏可以在任何位置进入，但当在附近敌人的探测半径内完成时，源氏将在侧翼被发现。<br/>"


[RM_CoupDeGrace X2AbilityTemplate]
LocFriendlyName="终结一击"
LocFlyOverText="终结一击"
LocLongDescription="源氏的<Ability:WeaponName/>攻击的第一个受损(混乱、眩晕等)单位将立即被击杀。每次任务触发1次。"
LocHelpText="源氏的<Ability:WeaponName/>攻击的第一个受损(混乱、眩晕等)单位将立即被击杀。每次任务触发1次。"
LocPromotionPopupText="<Bullet/> 仅对混乱，眩晕，失去意识的敌人有效。<br/>"

[RM_TacticalSense X2AbilityTemplate]
LocFriendlyName="战术意识"
LocFlyOverText="战术意识"
LocLongDescription="视野内的每个敌人为源氏+5防御，最多+25防御。"
LocHelpText="视野内的每个敌人为源氏+5防御，最多+25防御。"
LocPromotionPopupText="<Bullet/> 视野内的每个敌人为源氏+5防御，最多+25防御。<br/><Bullet/> 在小队视野范围内可见的单位不会获得增益。<br/><Bullet/> 如果单位混乱、眩晕、恐慌、燃烧或其他受损，该技能不会提供防御增益。"
;-----------------------
;	Genji Schematics
;-----------------------
[Odachi_MG_Schematic X2SchematicTemplate]
m_strClassLabel="无须"
[Odachi_BM_Schematic X2SchematicTemplate]
m_strClassLabel="无须"


[RM_WAKIZASHI_MG_Schematic X2SchematicTemplate]
m_strClassLabel="无须"
[RM_WAKIZASHI_BM_Schematic X2SchematicTemplate]
m_strClassLabel="无须"

;--------------------------
;	Genji Items/Schematics
;--------------------------
[Odachi_CV X2WeaponTemplate]
FriendlyName="<font color='#bf1e2e'>源氏野太刀(龙刃)</font>"
AbilityDescName="龙刃"
BriefSummary="源氏的野太刀，或他称之为“龙刃”，似乎是用能传导高频的材料制造的，这将使其能够立即精确切割。然而，传统材料只能走这么远..."
TacticalText="<Bullet/>野太刀。高频剑。\n<Bullet/>由于野太刀的独特性，只有源氏才能使用这种武器。"
FriendlyNamePlural="<font color='#bf1e2e'>源氏野太刀(龙刃)</font>"

[Odachi_MG X2WeaponTemplate]
FriendlyName="<font color='#bf1e2e'>源氏高级野太刀(龙刃)</font>"
AbilityDescName="龙刃"
BriefSummary="经过沈的升级，源氏的野太刀现在已经用调谐到高频的外星合金重新制作，使他能够更深入地攻击像异变者这样的敌人。"
TacticalText="<Bullet/>野太刀。高频剑。外星合金技术增强。\n<Bullet/>由于野太刀的独特性，只有源氏才能使用这种武器。"
FriendlyNamePlural="<font color='#bf1e2e'>源氏高级野太刀(龙刃)</font>"

[Odachi_BM X2WeaponTemplate]
FriendlyName="<font color='#bf1e2e'>源氏超铀野太刀(龙刃)</font>"
AbilityDescName="龙刃"
BriefSummary="在泰根的一些帮助下，源氏的野太刀已经改进到了绝对最大值，内置了一个超铀核心，允许他同时燃烧和切割。"
TacticalText="<Bullet/>野太刀。高频剑。超铀技术增强。\n<Bullet/>由于野太刀的独特性，只有源氏才能使用这种武器。"
FriendlyNamePlural="<font color='#bf1e2e'>源氏超铀野太刀(龙刃)</font>"

[RM_Wakizashi_CV X2PairedWeaponTemplate]
FriendlyName="<font color='#bf1e2e'>源氏肋差</font>"
AbilityDescName="<font color='#bf1e2e'>源氏肋差</font>"
BriefSummary="一把由前守望先锋特工岛田源氏携带并定制的辅助剑。"
TacticalText="<Bullet/> 与普通剑相比，源氏的肋差有一个优点，即可以在一个回合内多次使用。\n<Bullet/> 与源氏的一套苦无搭配。"
FriendlyNamePlural="<font color='#bf1e2e'>源氏肋差</font>"

[RM_Wakizashi_MG X2PairedWeaponTemplate]
FriendlyName="<font color='#bf1e2e'>源氏高级肋差</font>"
AbilityDescName="<font color='#bf1e2e'>源氏高级肋差</font>"
BriefSummary="一把由前守望先锋特工岛田源氏携带并定制的辅助剑。\n凭借我们掌握的磁力技术，肋差的刃片经过微量外星合金处理，使武器能够穿透大部分材料。"
TacticalText="<Bullet/> 与普通剑相比，源氏的肋差有一个优点，即可以在一个回合内多次使用。\n<Bullet/> 与源氏的一套苦无搭配。"
FriendlyNamePlural="<font color='#bf1e2e'>源氏高级肋差</font>"

[RM_Wakizashi_BM X2PairedWeaponTemplate]
FriendlyName="<font color='#bf1e2e'>源氏终极肋差</font>"
AbilityDescName="<font color='#bf1e2e'>源氏终极肋差</font>"
BriefSummary="一把由前守望先锋特工岛田源氏携带并定制的辅助剑。\n在外星技术和合金的结合下，肋差的刃片被外星合金和一些微量超铀浸泡。这会使刃片在极高的频率下产生共振，从而更容易切割对手和非常耐磨的材料。"
TacticalText="<Bullet/> 与普通剑相比，源氏的肋差有一个优点，即可以在一个回合内多次使用。\n<Bullet/> 与源氏的一套苦无搭配。"
FriendlyNamePlural="<font color='#bf1e2e'>源氏终极肋差</font>"

[GenjiKunai_CV X2WeaponTemplate]
FriendlyName="源氏苦无"
FriendlyNamePlural="苦无"
BriefSummary="一种最初为农民制造的工具，源氏学会了如何将这些工具制成有效的远程武器。"
TacticalText="<Bullet/>苦无是源氏的远程攻击武器。"
AbilityDescName="苦无"

[GenjiKunai_MG X2WeaponTemplate]
FriendlyName="源氏合金苦无"
FriendlyNamePlural="源氏合金苦无"
BriefSummary="一种最初为农民制造的工具，源氏学会了如何将这些工具制成有效的远程武器。外星合金增强了设计。"
TacticalText="<Bullet/>苦无是源氏的远程攻击武器。 "
AbilityDescName="苦无"

[GenjiKunai_BM X2WeaponTemplate]
FriendlyName="源氏终极苦无"
FriendlyNamePlural="源氏终极苦无"
BriefSummary="一种最初为农民制造的工具，源氏学会了如何将这些工具制成有效的远程武器。设计已经用外星合金进行了增强，并用超铀供电，使其在高频下共振。"
TacticalText="<Bullet/>苦无是源氏的远程攻击武器。"
AbilityDescName="苦无"


[GenjiArmor X2ArmorTemplate]
FriendlyName="<font color='#bf1e2e'>源氏护甲</font>"
FriendlyNamePlural="<font color='#bf1e2e'>源氏护甲</font>"
BriefSummary="源氏的控制论外骨骼是由守望先锋的顶级医生齐格勒博士制造的。它经受住了时间的考验..."
TacticalText="<Bullet/> 源氏将这件护甲作为基本装备的一部分。\n<Bullet/> 研究可以让我们获得更好的护甲。"

[PlatedGenjiArmor X2ArmorTemplate]
FriendlyName="<font color='#bf1e2e'>源氏镀层护甲</font>"
FriendlyNamePlural="<font color='#bf1e2e'>源氏镀层护甲</font>"
BriefSummary="源氏的控制论外骨骼，外加外星合金镀层，让他在更多的伤害中幸存下来。"
TacticalText="<Bullet/> 外骨骼使用了我们学到的先进装甲技术。"

[PoweredGenjiArmor X2ArmorTemplate]
FriendlyName="<font color='#bf1e2e'>源氏动力护甲</font>"
FriendlyNamePlural="<font color='#bf1e2e'>源氏动力护甲</font>"
BriefSummary="现在由超铀电池供电，源氏的外骨骼可以处理我们所能制造的最密集的镀层。"
TacticalText="<Bullet/> 动力护甲是源氏最好的防护装备。"


;--------------------------
;	Genji Cosmetics
;--------------------------
;Genji Helmet

[RM_Genji_Helmet X2BodyPartTemplate]
DisplayName="源氏Genji's Helmet"

[RM_Genji_Helmet_CF X2BodyPartTemplate]
DisplayName="源氏Genji's Helmet (Carbon Fibers)"

[RM_Genji_Helmet_CHR X2BodyPartTemplate]
DisplayName="源氏Genji's Helmet (Chrome)"

[Genji_Invisible X2BodyPartTemplate]
DisplayName="源氏Invisible Head - Genji"

; Genji LEFT ARM
[RM_CnvGenji_LeftArm X2BodyPartTemplate]
DisplayName="源氏Genji's Left Arm"

[RM_PltGenji_LeftArm X2BodyPartTemplate]
DisplayName="源氏Genji's Left Arm"

[RM_PwrGenji_LeftArm X2BodyPartTemplate]
DisplayName="源氏Genji's Left Arm"

[RM_CnvGenji_LeftArm_CF X2BodyPartTemplate]
DisplayName="源氏Genji's Left Arm (Carbon Fiber)"

[RM_PltGenji_LeftArm_CF X2BodyPartTemplate]
DisplayName="源氏Genji's Left Arm (Carbon Fiber)"

[RM_PwrGenji_LeftArm_CF X2BodyPartTemplate]
DisplayName="源氏Genji's Left Arm (Carbon Fiber)"


[RM_CnvGenji_LeftArm_CHR X2BodyPartTemplate]
DisplayName="源氏Genji's Left Arm (Chrome)"

[RM_PltGenji_LeftArm_CHR X2BodyPartTemplate]
DisplayName="源氏Genji's Left Arm (Chrome)"

[RM_PwrGenji_LeftArm_CHR X2BodyPartTemplate]
DisplayName="源氏Genji's Left Arm (Chrome)"


; Genji RIGHT ARM
[RM_CnvGenji_RightArm X2BodyPartTemplate]
DisplayName="源氏Genji's Right Arm"

[RM_PltGenji_RightArm X2BodyPartTemplate]
DisplayName="源氏Genji's Right Arm"

[RM_PwrGenji_RightArm X2BodyPartTemplate]
DisplayName="源氏Genji's Right Arm"

[RM_CnvGenji_RightArm_CF X2BodyPartTemplate]
DisplayName="源氏Genji's Right Arm (Carbon Fiber)"

[RM_PltGenji_RightArm_CF X2BodyPartTemplate]
DisplayName="源氏Genji's Right Arm (Carbon Fiber)"

[RM_PwrGenji_RightArm_CF X2BodyPartTemplate]
DisplayName="源氏Genji's Right Arm (Carbon Fiber)"

[RM_CnvGenji_RightArm_CHR X2BodyPartTemplate]
DisplayName="源氏Genji's Right Arm (Chrome)"

[RM_PltGenji_RightArm_CHR X2BodyPartTemplate]
DisplayName="源氏Genji's Right Arm (Chrome)"

[RM_PwrGenji_RightArm_CHR X2BodyPartTemplate]
DisplayName="源氏Genji's Right Arm (Chrome)"


;-----------------------
; Genji Misc Localization
;-----------------------

[Reward_GenjiUFO X2RewardTemplate]
DisplayName="调查任务"


[Reward_Genji X2RewardTemplate]
DisplayName="绿色赛博格忍者兄弟"

;-----------------------
; Genji Mission Data
;-----------------------
[MissionSource_GenjiRaid X2MissionSourceTemplate]
+MissionPinLabel="浪子兄弟"
+BattleOpName="迷失兄弟行动"
+MissionLaunchWarningText="指挥官，源氏已提出根据您在XCOM工作期间的需求专业化他的技能。我强烈建议在我们启动这项任务之前全面提升他。"

[GenjiRaid X2MissionTemplate]
+DisplayName="调查幽浮"
+Briefing="调查 - 劫持-侦查幽浮"
+PostMissionType="浪子兄弟"
+BriefingImage="img:///UILibrary_Common.Xcom_default"
+ObjectiveTextPools[0]="消灭所有敌人目标"
+ObjectiveTextPools[1]="为情报目的保护敌方幽浮"
+PreMissionNarratives[0]="X2NarrativeMoments.TACTICAL.SecureUFO.T_Secure_UFO_Narrative_Wrappers_01"
+PreMissionNarratives[1]="X2NarrativeMoments.TACTICAL.SecureUFO.T_Secure_UFO_Narrative_Wrappers_02"
+PreMissionNarratives[2]="X2NarrativeMoments.TACTICAL.SecureUFO.T_Secure_UFO_Narrative_Wrappers_03"
+PreMissionNarratives[3]="X2NarrativeMoments.TACTICAL.SecureUFO.T_Secure_UFO_Narrative_Wrappers_04"
+PreMissionNarratives[4]="X2NarrativeMoments.TACTICAL.SecureUFO.T_Secure_UFO_Narrative_Wrappers_05"

[DefaultGenjiRaid X2MissionNarrativeTemplate]
+ObjectiveTextPools[0]="消灭所有守卫幽浮的敌人"
+ObjectiveTextPools[1]="破坏敌人求救信标"
+ObjectiveTextPools[2]="撤离所有XCOM士兵"

[CovertAction_GenjiUFO X2CovertActionTemplate]
ActionObjective="搜寻源氏"

[CovertActionNarrative_GenjiUFO X2CovertActionNarrativeTemplate]
ActionName="搜寻游离中的特工"
ActionPreNarrative="一个被称为“守望先锋”的反抗组织向他们的一名特工岛田源氏发出了一份APB。他显然是在得知兄弟失踪的消息后四处游离。XCOM可能有助于追踪他的位置。"
ActionPostNarrative="随着尸体的踪迹和被摧毁的前哨站，我们终于找到了源氏，他正在观察一艘变种人幽浮。他向XCOM提出了一个提议：帮助他抓住它，他会加入我们。这是一个值得考虑的机会。"

[GenjiRaidComplete X2MissionFlavorTextTemplate]
FlavorText="MISSING FLAVOR TEXT"
CouncilSpokesmanSuccessText="指挥官，你在抓住这个机会反击位于<XGParam:StrValue0/!WorldRegionName/>的变种人方面做了一个模范的工作。即使岛田在寻找兄弟时不幸走到了死胡同。也就是说，他所展示的能力应该会对你解放地球的努力有所帮助。"
CouncilSpokesmanFailureText="很遗憾，我们错过了反击位于<XGParam:StrValue0/!WorldRegionName/>的变种人的机会，指挥官。虽然外星人会继续推进他们的行动，但我相信你们会找到其他方法阻止他们继续前进。"
